[MAIN]
DumpType=0x1964
RestartAppDef=1

[UI_Chs]
DlgTitle=错误报告程序
UIAppName=优酷PC客户端
CrashMsg1=很抱歉，程序%s发生了错误，即将关闭。
CrashMsg2=程序%s因为发生了错误，将自动关闭，这可能会导致刚才的部分工作不能完成。\n\n推荐您将错误报告发送给我们（客户端技术团队），我们可以根据此报告来改善软件的品质。\n\n我们将视这个报告为保密的，不会用作商业用途。
UserMsg=您可以在这里输入额外的信息：\r\n例如您的会员名，联系方式，发生错误时的具体操作等等。
RestartAppMsg=重新启动程序%s
ReportBtnText=发送报告(&R)
DetailsBtnText=查看详情(&D)
OkBtnText=确定(&O)
CancelBtnText=取消(&C)
ReportWayHttp=通过HTTP(&D)
ReportWayEmail=通过电子邮件(&E)
ReportWayDlgCaption=请选择发送报告的方式
DetailsFileNameColumn=文件名
DetailsFileSizeColumn=文件大小
ShowUserMessageTextBox=0
ShowRestartCheckBox=1

[UI_Eng]
DlgTitle=Error Reporting
UIAppName=TradeManager
CrashMsg1=Sorry, %s has encountered an error and needs to close.
CrashMsg2=%s has encountered an error and needs to close. Some of your jobs may not finished.\n\n We recommend your send the error report to us (TradeManager Technology Team). We will improve the TradeManager quality according to your report. \n\n We will deem your report as a secret and never use it for commercial purposes.
UserMsg=You can enter extra information here:\r\n e.g. your member ID, your contact ways or your solutions to errors.
RestartAppMsg=Restart %s
ReportBtnText=Report(&R)
DetailsBtnText=Details(&D)
OkBtnText=OK(&O)
CancelBtnText=Cancel(&C)
ReportWayHttp=By HTTP(&D)
ReportWayEmail=By E-mail(&E)
ReportWayDlgCaption=Please select your report way
DetailsFileNameColumn=File Name
DetailsFileSizeColumn=File Size
ShowUserMessageTextBox=0
ShowRestartCheckBox=1

[Network]
HttpPostUrl=http://data.wangwang.1688.com/uploadFile
HttpPostFileNameParam=filename
ServerUserName=+AQOa+XijKdBvGGKk2RFEQ==
ServerPassword=+z9gL3IufJ8=
MailtoName=
MailtoAddress=
MailSubject=
MailMsg=

[Storage]
DumpRootDir=dumps
DumpDirPrefix=
DumpFileName=Process.dmp
Files=log\\AliIM.log;update.log;dumphelp.txt;log\\imconfig.log
TextFileExts=.txt;.reg;.log;.ini;.cfg;.cpp;.h;.c;.xml
UserMsgFileName=UserMsg.txt
CreateFiles=

[Messages_Chs]
InvalidPid=__DISABLED_MESSAGE__
OpenProcessFaile=OpenProcess调用失败，错误号: %d。
CreateDumpDirFailed=创建Dump用的目录失败，错误号: %d。
CreateDumpFileFailed=创建Dump文件失败，错误号: %d。
MiniDumpFailed=MiniDumpWriteDump调用失败，错误号: %d。
CopyFileFailed=复制文件失败，错误号: %d。\r\n源文件:"%s"，\r\n目标文件"%s"\r\n。
CreateZipFailed=创建压缩包失败，文件名:"%s"。
ZipAddFailed=添加文件或文件夹到压缩包中失败，原因是："%s"。\r\n源文件(文件夹)是:"%s"。\r\n目标文件(文件夹)是："%s"。\r\n
SendEmailFailed=Email没有成功发送，请发送文件:"%s"到"%s"。
CrackUrlFailed=解析Url失败，错误号: %d。
Dumping=正在收集错误信息，请稍候……
Compressing=正在压缩收集到的信息，请稍候……
Posting=正在发送数据到服务器，请稍候……
UnknownError=发生了未知的错误

[Messages_Eng]
InvalidPid=__DISABLED_MESSAGE__
OpenProcessFaile= Calling OpenProcess failed. Error code: %d.
CreateDumpDirFailed=Creating directory for Dump failed. Error code:  %d.
CreateDumpFileFailed=Creating Dump files failed. Error code: %d.
MiniDumpFailed=Calling MiniDumpWriteDump failed. Error code: %d.
CopyFileFailed=Copying files failed. Error code: %d. \r\n Source file: "%s"，\r\n Target file: "%s"\r\n.
CreateZipFailed=Creating zip failed. File name: "%s".。
ZipAddFailed=Adding file or folder to zip failed. The reason is："%s". \r\n Source file (folder) is: "%s". \r\n The target file (folder) is: "%s".\r\n
SendEmailFailed=Email is failed to be send out. Please send File: "%s" to "%s".
CrackUrlFailed=Cracking Url failed. Error code: %d.
Dumping=Collecting error information, please wait……
Compressing=Compressing the collected information，please wait……
Posting=Sending data to the server, please wait……
UnknownError=An unknown error occurred

[MISC]
DetailsEditLimition=0x40000
DetailsFileReadLimition=0x40000
